# Pandas overview

## Data Frame

In [9]:
import pandas as pd

In [10]:
frame = pd.DataFrame({'numbers': range(10), 'chars': ['a']*10})

In [11]:
frame

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

### Read from .tsv file

In [18]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [22]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [23]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [24]:
frame.shape

(6, 4)

### Add new lines

In [44]:
new_line = {'Name': 'Жилкин Ф.И.', 'Birth': '05.11.1998', 'City': 'Санкт-Петербург', 'Position': 'Студент'}

In [45]:
frame = frame.append(new_line, ignore_index=True)
frame

              Name       Birth             City  Position  IsStudent
0      Иванов А.А.  22.03.1980           Москва       NaN        0.0
1     Сорокин И.В.  07.08.1965        Волгоград   инженер        0.0
2       Белов М.М.  13.02.1980           Ростов  менеджер        0.0
3  Мельникова Д.С.  15.04.1985           Ростов       NaN        0.0
4      Рыбина Е.П.  19.11.1985           Москва   инженер        0.0
5     Костров С.О.  31.05.1985           Москва    стажер        0.0
6      Жилкин Ф.И.  05.11.1998  Санкт-Петербург   Студент        1.0
7      Жилкин Ф.И.  05.11.1998  Санкт-Петербург   Студент        NaN

### Add new columns

In [46]:
frame['IsStudent'] = [False]*6 + [True]*2

In [47]:
frame

              Name       Birth             City  Position  IsStudent
0      Иванов А.А.  22.03.1980           Москва       NaN      False
1     Сорокин И.В.  07.08.1965        Волгоград   инженер      False
2       Белов М.М.  13.02.1980           Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985           Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985           Москва   инженер      False
5     Костров С.О.  31.05.1985           Москва    стажер      False
6      Жилкин Ф.И.  05.11.1998  Санкт-Петербург   Студент       True
7      Жилкин Ф.И.  05.11.1998  Санкт-Петербург   Студент       True

### Remove lines

In [48]:
frame.drop([7], axis=0, inplace=True)
frame

              Name       Birth             City  Position  IsStudent
0      Иванов А.А.  22.03.1980           Москва       NaN      False
1     Сорокин И.В.  07.08.1965        Волгоград   инженер      False
2       Белов М.М.  13.02.1980           Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985           Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985           Москва   инженер      False
5     Костров С.О.  31.05.1985           Москва    стажер      False
6      Жилкин Ф.И.  05.11.1998  Санкт-Петербург   Студент       True

### Remove columns

In [49]:
frame.drop('IsStudent', axis=1, inplace=True)
frame

              Name       Birth             City  Position
0      Иванов А.А.  22.03.1980           Москва       NaN
1     Сорокин И.В.  07.08.1965        Волгоград   инженер
2       Белов М.М.  13.02.1980           Ростов  менеджер
3  Мельникова Д.С.  15.04.1985           Ростов       NaN
4      Рыбина Е.П.  19.11.1985           Москва   инженер
5     Костров С.О.  31.05.1985           Москва    стажер
6      Жилкин Ф.И.  05.11.1998  Санкт-Петербург   Студент

### Write to .csv file

In [52]:
frame.to_csv('output_file.csv', sep=',', header=True, index=False)